### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_autoscale_setting.io_sign_issuer_func_itn[0] will be created
  + resource "azurerm_monitor_autoscale_setting" "io_sign_issuer_func_itn" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-sign-issuer-func-01-autoscale"
      + resource_group_name = "io-p-itn-sign-backend-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-sign-issuer-func-01-plan"

      + profile {
          + name = "default"

          + capacity {
              + default = 1
              + maximum = 5
              + minimum = 1
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 3500
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-sign-issuer-func-01-plan"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 60
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 2500
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT20M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-sign-issuer-func-01-plan"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 30
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT20M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # azurerm_private_endpoint.io_sign_issuer_func_itn will be created
  + resource "azurerm_private_endpoint" "io_sign_issuer_func_itn" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-sign-issuer-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-sign-data-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-sign-issuer-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # azurerm_private_endpoint.io_sign_issuer_func_staging_itn[0] will be created
  + resource "azurerm_private_endpoint" "io_sign_issuer_func_staging_itn" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-sign-issuer-func-staging-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-sign-data-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-sign-issuer-func-staging-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # azurerm_role_assignment.issuer_func_api_keys_queue_processor_role_itn will be created
  + resource "azurerm_role_assignment" "issuer_func_api_keys_queue_processor_role_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-sign-data-rg/providers/Microsoft.Storage/storageAccounts/iopsignst/queueServices/default/queues/api-keys"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.io_sign_issuer_func_itn.azurerm_app_service_virtual_network_swift_connection.this[0] will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "this" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.io_sign_issuer_func_itn.azurerm_linux_function_app.this will be created
  + resource "azurerm_linux_function_app" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                   = "5"
          + "AnalyticsEventHubConnectionString"                 = (sensitive value)
          + "AzureWebJobs.CreateDossier.Disabled"               = "true"
          + "AzureWebJobs.CreateIssuer.Disabled"                = "true"
          + "AzureWebJobs.CreateIssuerByVatNumberView.Disabled" = "true"
          + "AzureWebJobs.CreateSignatureRequest.Disabled"      = "true"
          + "AzureWebJobs.GetDossier.Disabled"                  = "true"
          + "AzureWebJobs.GetRequestsByDossier.Disabled"        = "true"
          + "AzureWebJobs.GetSignatureRequest.Disabled"         = "true"
          + "AzureWebJobs.GetSignerByFiscalCode.Disabled"       = "true"
          + "AzureWebJobs.GetUploadUrl.Disabled"                = "true"
          + "AzureWebJobs.MarkAsRejected.Disabled"              = "true"
          + "AzureWebJobs.MarkAsSigned.Disabled"                = "true"
          + "AzureWebJobs.MarkAsWaitForSignature.Disabled"      = "true"
          + "AzureWebJobs.SendNotification.Disabled"            = "true"
          + "AzureWebJobs.SetSignatureRequestStatus.Disabled"   = "true"
          + "AzureWebJobs.ValidateDocument.Disabled"            = "true"
          + "AzureWebJobs.ValidateUpload.Disabled"              = "true"
          + "AzureWebJobsDisableHomepage"                       = "true"
          + "BackOfficeApiBasePath"                             = "https://api.io.pagopa.it/api/v1/sign/backoffice"
          + "BackOfficeApiKey"                                  = (sensitive value)
          + "BillingEventHubConnectionString"                   = (sensitive value)
          + "CosmosDbConnectionString"                          = (sensitive value)
          + "CosmosDbDatabaseName"                              = "issuer"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                    = "4"
          + "IoServicesApiBasePath"                             = "https://api.io.pagopa.it"
          + "IoServicesConfigurationId"                         = (sensitive value)
          + "IoServicesSubscriptionKey"                         = (sensitive value)
          + "IssuerUploadedBlobContainerName"                   = "uploaded-documents"
          + "IssuerValidatedBlobContainerName"                  = "validated-documents"
          + "NODE_ENV"                                          = "production"
          + "PdvTokenizerApiBasePath"                           = "https://api.tokenizer.pdv.pagopa.it"
          + "PdvTokenizerApiKey"                                = (sensitive value)
          + "SLOT_TASK_HUBNAME"                                 = "ProductionTaskHub"
          + "SelfCareApiBasePath"                               = "https://api.selfcare.pagopa.it"
          + "SelfCareApiKey"                                    = (sensitive value)
          + "SelfCareEventHubConnectionString"                  = (sensitive value)
          + "SlackWebhookUrl"                                   = (sensitive value)
          + "StorageAccountConnectionString"                    = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"   = "1"
          + "WEBSITE_DNS_SERVER"                                = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                          = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-sign-issuer-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "io-p-itn-sign-backend-rg-01"
      + service_plan_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-sign-issuer-func-01-plan"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "iopitnsignissuerstfn01"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_key                = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/v1/sign/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = 1
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "SLOT_TASK_HUBNAME",
              + "AzureWebJobs.CreateDossier.Disabled",
              + "AzureWebJobs.CreateIssuer.Disabled",
              + "AzureWebJobs.CreateIssuerByVatNumberView.Disabled",
              + "AzureWebJobs.CreateSignatureRequest.Disabled",
              + "AzureWebJobs.GetDossier.Disabled",
              + "AzureWebJobs.GetRequestsByDossier.Disabled",
              + "AzureWebJobs.GetSignatureRequest.Disabled",
              + "AzureWebJobs.GetSignerByFiscalCode.Disabled",
              + "AzureWebJobs.GetUploadUrl.Disabled",
              + "AzureWebJobs.MarkAsRejected.Disabled",
              + "AzureWebJobs.MarkAsSigned.Disabled",
              + "AzureWebJobs.MarkAsWaitForSignature.Disabled",
              + "AzureWebJobs.SendNotification.Disabled",
              + "AzureWebJobs.SetSignatureRequestStatus.Disabled",
              + "AzureWebJobs.ValidateDocument.Disabled",
              + "AzureWebJobs.ValidateUpload.Disabled",
            ]
        }
    }

  # module.io_sign_issuer_func_itn.azurerm_monitor_metric_alert.function_app_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      + auto_mitigate            = false
      + description              = "Function availability is under threshold level. Runbook: -"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[io-p-itn-sign-issuer-func-01] Health Check Failed"
      + resource_group_name      = "io-p-itn-sign-backend-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HealthCheckStatus"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # module.io_sign_issuer_func_staging_slot_itn[0].azurerm_app_service_slot_virtual_network_swift_connection.this[0] will be created
  + resource "azurerm_app_service_slot_virtual_network_swift_connection" "this" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + slot_name      = "staging"
      + subnet_id      = (known after apply)
    }

  # module.io_sign_issuer_func_staging_slot_itn[0].azurerm_linux_function_app_slot.this will be created
  + resource "azurerm_linux_function_app_slot" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                   = "5"
          + "AnalyticsEventHubConnectionString"                 = (sensitive value)
          + "AzureWebJobs.CreateDossier.Disabled"               = "true"
          + "AzureWebJobs.CreateIssuer.Disabled"                = "true"
          + "AzureWebJobs.CreateIssuerByVatNumberView.Disabled" = "true"
          + "AzureWebJobs.CreateSignatureRequest.Disabled"      = "true"
          + "AzureWebJobs.GetDossier.Disabled"                  = "true"
          + "AzureWebJobs.GetRequestsByDossier.Disabled"        = "true"
          + "AzureWebJobs.GetSignatureRequest.Disabled"         = "true"
          + "AzureWebJobs.GetSignerByFiscalCode.Disabled"       = "true"
          + "AzureWebJobs.GetUploadUrl.Disabled"                = "true"
          + "AzureWebJobs.MarkAsRejected.Disabled"              = "true"
          + "AzureWebJobs.MarkAsSigned.Disabled"                = "true"
          + "AzureWebJobs.MarkAsWaitForSignature.Disabled"      = "true"
          + "AzureWebJobs.SendNotification.Disabled"            = "true"
          + "AzureWebJobs.SetSignatureRequestStatus.Disabled"   = "true"
          + "AzureWebJobs.ValidateDocument.Disabled"            = "true"
          + "AzureWebJobs.ValidateUpload.Disabled"              = "true"
          + "AzureWebJobsDisableHomepage"                       = "true"
          + "BackOfficeApiBasePath"                             = "https://api.io.pagopa.it/api/v1/sign/backoffice"
          + "BackOfficeApiKey"                                  = (sensitive value)
          + "BillingEventHubConnectionString"                   = (sensitive value)
          + "CosmosDbConnectionString"                          = (sensitive value)
          + "CosmosDbDatabaseName"                              = "issuer"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                    = "4"
          + "IoServicesApiBasePath"                             = "https://api.io.pagopa.it"
          + "IoServicesConfigurationId"                         = (sensitive value)
          + "IoServicesSubscriptionKey"                         = (sensitive value)
          + "IssuerUploadedBlobContainerName"                   = "uploaded-documents"
          + "IssuerValidatedBlobContainerName"                  = "validated-documents"
          + "NODE_ENV"                                          = "production"
          + "PdvTokenizerApiBasePath"                           = "https://api.tokenizer.pdv.pagopa.it"
          + "PdvTokenizerApiKey"                                = (sensitive value)
          + "SLOT_TASK_HUBNAME"                                 = "StagingTaskHub"
          + "SelfCareApiBasePath"                               = "https://api.selfcare.pagopa.it"
          + "SelfCareApiKey"                                    = (sensitive value)
          + "SelfCareEventHubConnectionString"                  = (sensitive value)
          + "SlackWebhookUrl"                                   = (sensitive value)
          + "StorageAccountConnectionString"                    = (sensitive value)
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"   = "1"
          + "WEBSITE_DNS_SERVER"                                = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                          = "1"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + function_app_id                                = (known after apply)
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (sensitive value)
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + webdeploy_publish_basic_authentication_enabled = true

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_key                = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/v1/sign/info"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = 1
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.io_sign_snet_itn.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.20.17.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-sign-snet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + service_endpoints                              = [
          + "Microsoft.AzureCosmosDB",
          + "Microsoft.Storage",
          + "Microsoft.Web",
        ]
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.io_sign_issuer_func_itn.module.storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnsignissuerfunc01st] Low Availability" -> (known after apply)
      ~ name                     = "[iopitnsignissuerfunc01st] Low Availability" -> "[iopitnsignissuerstfn01] Low Availability" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignissuerfunc01st",
        ] -> (known after apply)
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.io_sign_issuer_func_itn.module.storage_account.azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-sign-backend-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsignissuerfunc01st" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
      ~ name                               = "iopitnsignissuerfunc01st" -> "iopitnsignissuerstfn01" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://iopitnsignissuerfunc01st.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "iopitnsignissuerfunc01st.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://iopitnsignissuerfunc01st.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "iopitnsignissuerfunc01st.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://iopitnsignissuerfunc01st.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "iopitnsignissuerfunc01st.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "italynorth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://iopitnsignissuerfunc01st.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "iopitnsignissuerfunc01st.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://iopitnsignissuerfunc01st.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "iopitnsignissuerfunc01st.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://iopitnsignissuerfunc01st.z38.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "iopitnsignissuerfunc01st.z38.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Firma"
            "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
        # (21 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 12 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.cosmosdb_account.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmosdb_account/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 24 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)
```

</details>
